//
//  Words.swift
//  Allias
//
//  Created by Сергей on 07.05.2022.
//

import UIKit

class Words {
    
    let wordsArrayEasy  = ["кран",
                           "лопата",
                           "овца",
                           "учитель",
                           "человек",
                           "завтрак",
                           "дневник",
                           "паровоз"]

    let wordsArrayMedium = ["Тарзанка",
                            "граница",
                            "переправа",
                            "стальные нервы",
                            "строительные леса",
                            "пуленепробиваемое стекло",
                            "сквозняк",
                            "литературный вечер"]

    let wordsArrayHard =  ["сыр",
                           "электростанция",
                           "редко",
                           "противник",
                           "пейзаж",
                           "Сибирь",
                           "каштан",
                           "Крейсер Аврора"]
    // массивы слов в зависимости от уровня сложности

    var wordsCard = [String]()
    // массив слов, который передается на экран GameVC
    // при выборе уровня сложности игры

    let cardLength = 8 // количество слов в карточке
    
    func chooseGameLevel () {
        // wordsCard =
        // case Button
    }
    
    func deleteWord () {

    }
    
}

