//
//  LocalDictionary.swift
//  Allias
//
//  Created by Наталья Гапеева on 07.05.2022.
//

import Foundation

struct LocalDictionary {
    
    let wordsArrayEasy  = ["кран", "лопата", "овца", "учитель", "человек", "завтрак",
                              "дневник", "паровоз", "градусник", "лейка", "кактус",
                              "пельмени", "единоборство", "момент", "джакузи", "император",
                              "ромашка", "плотник", "булка с подвидлом", "шпроты", "штанга",
                              "сачок", "очередь", "фартук", "дятел", "дирижер", "кредитная карта",
                              "пульверизатор", "гиря", "батон", "помидоры", "пуховик", "рубин",
                              "черемуха", "улица", "тракторист", "Земля", "лестница", "камин",
                              "корыто", "гайка", "грузовой автомобиль", "студент", "букварь",
                              "клуб", "шахматы", "спортсмен", "колебание", "кровать", "люстра",
                              "вишня", "кит", "банный веник", "огурец", "лес", "кирпич", "розетка",
                              "опыление", "производство", "плинтус"]

    let wordsArrayMedium = ["тарзанка", "граница", "переправа", "стальные нервы",
                               "строительные леса", "пуленепробиваемое стекло",
                               "сквозняк", "литературный вечер", "коралловый риф",
                               "очередь", "эгоист", "надзиратель", "блестящий",
                               "путевка", "командировка", "тунеядец", "мастерство",
                               "лукошко", "грамота", "крапива", "бобер", "приманка", "румба",
                               "пельмени", "момент", "ситуация", "город", "алюминий",
                               "блошиный рынок", "интрига", "отзыв", "туя", "алгоритм",
                               "Коко Шанель", "переполненный", "азбука Морзе", "золотой слиток",
                               "диаметр", "ипподром", "практика", "четверг", "телега",
                               "кондуктор", "цемент", "планка", "переводчик", "иностранец",
                               "рецепт", "кот Леопольд", "майка", "ракета", "трава", "радио",
                               "шерсть", "каша", "рыба", "туалет", "рейка", "основа", "отчет"]

    let wordsArrayHard =   ["сыр", "электростанция", "редко", "противник", "пейзаж", "Сибирь",
                               "каштан", "Крейсер Аврора", "ипотека", "балкон", "материк",
                               "комбинация", "брокколи", "цукини", "проверка", "крик",
                               "антракт", "желатин","судьба","почва","антракт","настройка",
                               "самообслуживание", "визит", "макет", "образование","племянник",
                               "мох", "терминал", "ломбард", "климат", "пеликан", "манго", "клоп",
                               "факир", "раса", "полиглот", "биржа", "новости", "волынка",
                               "прибор", "балласт", "уксус", "иллюзия", "песчаная буря",
                               "прятки", "исправление", "свекровь", "интрига", "бюро",
                               "машина времени", "судебное делопроизводство", "каземат",
                               "материк", "астрофизика", "шумопоглощение", "барокко",
                               "инсталляция", "бакалея", "коррозия"]
    
    let taskDictionary = ["Стоя на одной ноге", "Не используя глаголы", "Не говори, а покажи"]
}

