//
//  LocalDictionary.swift
//  Allias
//
//  Created by Наталья Гапеева on 07.05.2022.
//

import Foundation

struct LocalDictionary {
    let wordsArrayEasy = ["кран", "лопата", "овца", "учитель", "человек", "завтрак", "дневник", "паровоз"]

    let wordsArrayMedium = ["Тарзанка", "граница", "переправа", "стальные нервы", "строительные леса", "пуленепробиваемое стекло",   "сквозняк", "литературны вечер"]

    let wordsArrayHard = ["сыр", "электростанция", "редко", "противник", "пейзаж", "Сибирь",  "каштан", "Крейсер Аврора"]
    
    let taskDictionary = ["Стоя на одной ноге", "Не используя глаголы", "Не говори, а покажи"]
}

